АвтосалонНаGitHub/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

АвтосалонНаGitHub/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРожденияКлиента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

АвтосалонНаGitHub/HTTPServices/reg/Ext/Module.bsl
Функция getRegGET(Запрос)
  Логин = Строка(Запрос.ПараметрыЗапроса.Получить("name"));
  НомерТелефона = Строка(Запрос.ПараметрыЗапроса.Получить("phone"));
  
  НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
   НовыйПользовательИБ.Имя = Логин;
   НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
НовыйПользовательИБ.Записать();
  
  НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
  НовыйКонтрагент.Наименование = Логин;
  НовыйКонтрагент.КонтактныйТелефон = НомерТелефона;
  НовыйКонтрагент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Покупатель;
  НовыйКонтрагент.Комментарий = "Пользователь зарегистрированный из мобильного приложения";
  НовыйКонтрагент.Записать();    
    
    НовыйПользовательСправочник = Справочники.Пользователи.СоздатьЭлемент();
    НовыйПользовательСправочник.Код = НовыйПользовательИБ.УникальныйИдентификатор;
    НовыйПользовательСправочник.Клиент = НовыйКонтрагент.Ссылка;  
    НовыйПользовательСправочник.Наименование = Логин;
	НовыйПользовательСправочник.Записать(); 
      
  
  ЗапросПользователи = Новый Запрос; 
    ЗапросПользователи.Текст = "ВЫБРАТЬ
                               |  УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
                               |  Пользователи.Наименование КАК Наименование,
                               |  Пользователи.Код КАК Код
                               |ИЗ
                               |  Справочник.Пользователи КАК Пользователи
                               |ГДЕ
                               |  Пользователи.Ссылка = &Ссылка";
    ЗапросПользователи.УстановитьПараметр("Ссылка", НовыйПользовательСправочник.Ссылка); 

    МассивПользователей = Новый Массив; 

    Выборка = ЗапросПользователи.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл

    ДанныеПользователя = Новый Структура; 
    ДанныеПользователя.Вставить("guid", Строка(Выборка.Ссылка));
    ДанныеПользователя.Вставить("name", Строка(Выборка.Наименование));
    ДанныеПользователя.Вставить("code", Строка(Выборка.Код));

    МассивПользователей.Добавить(ДанныеПользователя); 

    КонецЦикла;

    Ответ = Новый HTTPСервисОтвет(200); 

    ЗаписьJSON = Новый ЗаписьJSON; 
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, МассивПользователей);
    СтрокаОтвета = ЗаписьJSON.Закрыть();

    Ответ.УстановитьТелоИзСтроки(СтрокаОтвета); 

    Возврат Ответ; 
КонецФункции
